{"keras_version": "2.2.4", "config": {"layers": [{"name": "input_1", "config": {"batch_input_shape": [null, 105, 105, 1], "sparse": false, "dtype": "float32", "name": "input_1"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "input_2", "config": {"batch_input_shape": [null, 105, 105, 1], "sparse": false, "dtype": "float32", "name": "input_2"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "sequential_1", "config": {"layers": [{"config": {"batch_input_shape": [null, 105, 105, 1], "filters": 64, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [10, 10], "activation": "relu", "data_format": "channels_last", "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "valid", "use_bias": true, "dilation_rate": [1, 1], "dtype": "float32", "name": "Conv1"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"filters": 128, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [7, 7], "activation": "relu", "data_format": "channels_last", "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "trainable": true, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "padding": "valid", "dilation_rate": [1, 1], "name": "Conv2"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"filters": 128, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 4], "activation": "relu", "data_format": "channels_last", "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "trainable": true, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "padding": "valid", "dilation_rate": [1, 1], "name": "Conv3"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"filters": 256, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 4], "activation": "relu", "data_format": "channels_last", "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "trainable": true, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "padding": "valid", "dilation_rate": [1, 1], "name": "Conv4"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_4"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 4096, "activation": "sigmoid", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "trainable": true, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "name": "Dense1", "activity_regularizer": null}, "class_name": "Dense"}], "name": "sequential_1"}, "inbound_nodes": [[["input_1", 0, 0, {}]], [["input_2", 0, 0, {}]]], "class_name": "Sequential"}, {"name": "lambda_1", "config": {"arguments": {}, "output_shape_type": "raw", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcxkAAAB0AABqAQB8AABkAQAZfAAAZAIAGRiDAQBTKQNO6QAA\nAADpAQAAACkC2gFL2gNhYnMpAdoHdGVuc29yc6kAcgYAAAD6WS9haXRvZS9RdWlja0RyYXcvUm9u\nYWsvb21uaWdsb3QvU2lhbWVzZS1OZXR3b3Jrcy1mb3ItT25lLVNob3QtTGVhcm5pbmcvc2lhbWVz\nZV9uZXR3b3JrLnB52gg8bGFtYmRhPoMAAADzAAAAAA==\n", null, null], "name": "lambda_1", "function_type": "lambda", "output_shape": null}, "inbound_nodes": [[["sequential_1", 1, 0, {}], ["sequential_1", 2, 0, {}]]], "class_name": "Lambda"}, {"name": "dense_1", "config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "sigmoid", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "dense_1"}, "inbound_nodes": [[["lambda_1", 0, 0, {}]]], "class_name": "Dense"}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "name": "model_1", "output_layers": [["dense_1", 0, 0]]}, "backend": "tensorflow", "class_name": "Model"}